app/Http/Controllers/AdminController.php

    public function index()
    {
        //
        $user = User::count();
        $order = Order::count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `orders`

    public function create()
    {
        $user = User::all();
---
select * from `users`

    public function store(Request $request)
    {
        // //
        $user = User::all();

        $user = new User();
        $user->name = $request->name;
        $user->email = $request->email;
        $user->alamat = $request->alamat;
        $user->phone = $request->phone;
        $user->role = $request->role;
        $user->password = Hash::make($request->password);
        $user->save();
---
select * from `users`
insert into `users` (`name`, `email`, `alamat`, `phone`, `role`, `password`, `updated_at`, `created_at`) values ('kol', 'kol@kol.kol', 'Jabon', '21', 'user', '$2y$10$qRyjJHVUk.iGfvo4mpdAUuR8BedjjocNsBUcE70UdDHwre5OUExii', '2023-07-14 13:20:37', '2023-07-14 13:20:37')

    public function listorder(){
        $order = Order::with(['OrderDetail', 'OrderDetail.Paket', 'user'])->get();
---
select * from `orders`
select * from `users` where `users`.`id` in (2, 4)