app/Http/Controllers/OrderController.php

    public function store(StoreOrderRequest $request)
    {
        //

        // $validate = $request->validate([
        //     'kilo' => 'integer',
        //     'bawahan' => 'integer',
        //     'atasan' => 'integer',
        // ]);

        if ($request->kilo == ""){
            $error = "Silahkan isi jumlah kilogram";
            return redirect(route('pktkilo'))->withErrors($error);
        }else{
            $kilo = $request->kilo * 10000;

            $order = Order::all();

            $order = new Order();
            $order->user_id = $request->user_id;
            $order->kilo = $request->kilo;
            $order->harga = $kilo;
            $order->status = $request->status;
            $order->save();
---
select * from `orders`
insert into `orders` (`user_id`, `kilo`, `harga`, `status`, `updated_at`, `created_at`) values ('2', '5', 50000, 'Order', '2023-07-14 07:14:04', '2023-07-14 07:14:04')

    public function pktbiji(){
        $paket = Paket::all();
---
select * from `pakets`