app/Http/Controllers/UserController.php

select * from `orders` where `user_id` = 8
---
    public function index()
    {
        // untuk format rupiah
        Blade::directive('currency', function ($expression) {
            return "Rp. <?php echo number_format($expression, 0, ',', '.'); ?>";
        });



        $user = Auth::user()->id;
        $order = Order::with(['OrderDetail', 'OrderDetail.Paket'])->where('user_id', $user)->get();